performance/notes-performance.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">

  <hashTree>

    <TestPlan guiclass="TestPlanGui"
              testclass="TestPlan"
              testname="Notes Load Test"
              enabled="true">

      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>

    </TestPlan>

    <hashTree>

      <ThreadGroup guiclass="ThreadGroupGui"
                   testclass="ThreadGroup"
                   testname="Users Load"
                   enabled="true">

        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>

        <elementProp name="ThreadGroup.main_controller"
                     elementType="LoopController"
                     guiclass="LoopControlPanel"
                     testclass="LoopController">

          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>

        </elementProp>

      </ThreadGroup>

      <hashTree>

        <CSVDataSet guiclass="TestBeanGUI"
                    testclass="CSVDataSet"
                    testname="User Data"
                    enabled="true">

          <stringProp name="filename">performance/users.csv</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="variableNames">email,password</stringProp>
          <stringProp name="delimiter">,</stringProp>

          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>

        </CSVDataSet>

        <hashTree/>

        <!-- login header -->
        <HeaderManager guiclass="HeaderPanel"
                       testclass="HeaderManager"
                       testname="Login Headers"
                       enabled="true">

          <collectionProp name="HeaderManager.headers">

            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>

          </collectionProp>

        </HeaderManager>

        <hashTree/>

        <!-- login request -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                          testclass="HTTPSamplerProxy"
                          testname="Login API"
                          enabled="true">

          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.domain">practice.expandtesting.com</stringProp>
          <stringProp name="HTTPSampler.path">/notes/api/users/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>

          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>

          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">

            <collectionProp name="Arguments.arguments">

              <elementProp name="" elementType="HTTPArgument">

                <stringProp name="Argument.value">
                    {"email":"${email}","password":"${password}"}
                </stringProp>

              </elementProp>

            </collectionProp>

          </elementProp>

        </HTTPSamplerProxy>

        <hashTree>

          <!-- extract auth token  -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui"
                             testclass="JSONPostProcessor"
                             testname="Extract Token"
                             enabled="true">

            <stringProp name="JSONPostProcessor.referenceNames">token</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.token</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>

          </JSONPostProcessor>

        </hashTree>

        <!-- get notes -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                          testclass="HTTPSamplerProxy"
                          testname="Get Notes"
                          enabled="true">

          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.domain">practice.expandtesting.com</stringProp>
          <stringProp name="HTTPSampler.path">/notes/api/notes</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>

        </HTTPSamplerProxy>

        <hashTree>

          <!-- auth header -->
          <HeaderManager guiclass="HeaderPanel"
                         testclass="HeaderManager"
                         testname="Auth Header"
                         enabled="true">

            <collectionProp name="HeaderManager.headers">

              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">x-auth-token</stringProp>
                <stringProp name="Header.value">${token}</stringProp>
              </elementProp>

            </collectionProp>

          </HeaderManager>

        </hashTree>

      </hashTree>

    </hashTree>

  </hashTree>

</jmeterTestPlan>